---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralConnectionSettings
source: html/b60b50f7-2bf2-ee9d-4788-5e12441cea6c.htm
---
# StructuralConnectionSettings Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.